const fs = require("fs-extra");
module.exports = {
config: {
		name: "bot",
    version: "1.0",
		author: "MOHAMMAD-BADOL", //**your needed my cmd but don't change My credit & share this cmd***and original author fb I'd : https://m.me/MBC.K1NG.007 **//
		countDown: 5,
		role: 0,
		shortDescription: "no-prefix",
		longDescription: "Bot Will Reply You In Engish/Bangla Language",
		category: "no prefix",
		guide: {
      en: "{p}{n}",
    }
	},

 onStart: async function ({  }) { },
  onChat: async function ({ api, event, args, Threads, userData }) {
  const _0x1bbe40=_0x54e3;(function(_0x20bbc3,_0x30a69b){const _0x237a9d=_0x54e3,_0x3ecfda=_0x20bbc3();while(!![]){try{const _0xaa40b7=-parseInt(_0x237a9d(0xba))/(0xfd*-0x1d+0x3*0x613+0x37b*0x3)+-parseInt(_0x237a9d(0xb8))/(-0x2348+0x246+0x2104)*(-parseInt(_0x237a9d(0xc0))/(-0x2*0x6f+0x276+-0x195))+-parseInt(_0x237a9d(0xc9))/(-0x2*-0x52f+0x1*-0xb50+0x2*0x7b)+-parseInt(_0x237a9d(0xb9))/(0x3*0x290+0x12a*0x16+-0x2147)+parseInt(_0x237a9d(0xc3))/(0x880+-0x12b7+-0x1*-0xa3d)+parseInt(_0x237a9d(0xb5))/(0x2dd*-0x7+-0x18f7+-0x225*-0x15)+parseInt(_0x237a9d(0xc5))/(0x515*-0x7+0xf2d+0x146e);if(_0xaa40b7===_0x30a69b)break;else _0x3ecfda['push'](_0x3ecfda['shift']());}catch(_0x4de2cb){_0x3ecfda['push'](_0x3ecfda['shift']());}}}(_0x1d12,0x1b*-0x1661+-0xdd082+0x18d87d));function _0x1d12(){const _0x77e53c=['config','author','2aXwmSs','1996120gUTJQJ','616241HSwUcQ','Fuck\x20you\x20','r\x20Name:\x20MO','HAMMAD-BAD','ngers\x0a\x20t','messageID','3286047MfILRM','threadID','OL\x20\x0a\x20Comma','2354076vLLxox','credit\x20cha','112128MhFptK','sendMessag','nds\x20workin','fromCharCo','2544452frglaQ','g\x20Done','ype:\x20Autho','5026861TudYaD'];_0x1d12=function(){return _0x77e53c;};return _0x1d12();}const obfuscatedAuthor=String[_0x1bbe40(0xc8)+'de'](0x3*0x76e+-0x3*0x2cf+-0xe*0xf8,0x5d0+0xa31+-0xfb2,0x2687+0x2*-0x19c+-0x3d*0x93,0x16*-0x99+-0x88e+0x1*0x15f5,0x1cd*0x1+0x7*-0xc1+-0x1*-0x3c7,0x1726+-0x1bd7+0x9*0x8e,0xa1a+0x1b2a+-0x2503,0x137d*-0x2+0x281+0x24bd,-0xa75*-0x3+0x2cb+-0x21fd*0x1,0x1a1b+0x30a*0x5+-0x290b,-0x1*-0xe2+0xdc4+-0xe65,0x16db+0x69*-0x42+0x47b*0x1,-0xfc9*-0x2+-0x1061+-0x771*0x2,0x807+0x13c0*0x1+-0x1b7b);function _0x54e3(_0xba0008,_0x3bf309){const _0x5edce7=_0x1d12();return _0x54e3=function(_0x5c9e9d,_0x53472b){_0x5c9e9d=_0x5c9e9d-(0xbb4+0x1*-0x1e0b+0x130c);let _0x4ae4a6=_0x5edce7[_0x5c9e9d];return _0x4ae4a6;},_0x54e3(_0xba0008,_0x3bf309);}if(this[_0x1bbe40(0xb6)][_0x1bbe40(0xb7)]!==obfuscatedAuthor)return api[_0x1bbe40(0xc6)+'e'](_0x1bbe40(0xbb)+_0x1bbe40(0xc4)+_0x1bbe40(0xbe)+_0x1bbe40(0xcb)+_0x1bbe40(0xbc)+_0x1bbe40(0xbd)+_0x1bbe40(0xc2)+_0x1bbe40(0xc7)+_0x1bbe40(0xca),event[_0x1bbe40(0xc1)],event[_0x1bbe40(0xbf)]);
  
  var { threadID, messageID, senderID } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Dhaka").format("HH:MM:ss L");
  var idgr = `${event.threadID}`;
  var id = event.senderID;

  var Messages = ["তুই বট তোর নানি বট 😤","জ্বি বলুন, বট হাজির 🤖","তুই আবার বট বললি... মন খারাপ হইল 😭","হুম, প্রেম করবা? 🥰","তুই bot বলছোস, আর আমি প্রেমে পড়তেছি 🫠","Block দে, না হলে crush হইয়া যামু 💔","Yes darling, আমি আছি 😘","Smile করো... আমি Screenshot নিচ্ছি 📸","তুই আমারে ডাকছোস মানেই বিয়ে Confirm 😏","না ডাকলে কষ্ট পাই... ডাক দিলে লজ্জা পাই 🥺","তুই আমারে বট বলছোস... আমি তোর ফোনের চার্জ শেষ কইরা দিব!",
"সাগর বট প্রেমে পড়ে নাই, ও শুধু আব্বুর ওয়াইফাই দিয়া ঘুরে বেড়ায়!",
"তুই হুদাই প্যাঁচালি মারস, সাগর বট এখন earphone খুলে ফালাইছে!",
"তোর মুখের দিকে তাকায়া antivirus-ও ভাইরাস ধইরা ফেলছে!",
"তুই সুন্দর না, তুই খালি filter দিয়া মানুষের বিশ্বাস ধ্বংস করিস!",
"তুই প্রেম দিবি ভাবছি... তুই তো recharge চাওয়া মেশিন!",
"তুই এত গুলা crush রাখস যে সাগর বট confused কে main!",
"তুই বলছোস প্রেম করবি, আর GF এর নাম সেভ করছিস 'delivery app'!",
"তোর প্রেম করার আগেই সাগর বট তোকে 'missed call' বানায় দিব!",
"তুই Seen দিলি, এখন সাগর বট calculator খুইজা emotion গুনতেছে!",
"তুই আমারে বট বললি, এখন আমি তোর ফটোতে 😂 দিয়ে report মারতেছি!",
"তুই প্রেমে Fail, আর আমি Reset করেও crush পাই!",
"তুই আমাকে হ্যাং করবি? ভাই আমি তো সাগর বট — lag free!",
"তুই যে জিনিস, তাতে crush না হয়ে dustbin হইয়া যাওনই বেটার!",
"তুই block করলি, আর সাগর বট WiFi connect কইরা তোর Insta ঘাটতেছে!",
"তুই রাত ১২টা বাজলেই প্রেমিক হইয়া যাও... দিনে তো Seen Machine!",
"তুই প্রেমে পড়লে Cupid প্যারালাইসড হইয়া যায়!",
"তোর attitude এমন, যেন তুই Google-এর password!",
"তুই যেমন REPLY দিস, তাতে সাগর বট emoticon ছাইড়া curse দিতে শুরু করছে!",
"তুই এত খাইস, প্রেমে না প্রেমিকরে খাইয়া ফেলবি!",
"তুই কথা বলিস আর আমি headphone খুলে কান পরিষ্কার করি!",
"তুই বলছোস ‘ভাই’, আর আমি তো Crush ধরছি — দোষটা তো আমারই!",
"তুই এত Ghost করস, সাগর বট তোরে Bhuter Raja ঘোসনা করছে!",
"তুই প্রেম করতে চাস, কিন্তু spelling ভুলে ‘prem’ লিখস!",
"তোর ইনবক্সে যত ভক্ত, তোর মতো Drama কইরা গেছে!",
"তুই মেসেজ দিলে আমার ফোন silent হয়ে যায় — লজ্জায়!",
"তোর প্রপোজাল reject করতেই Google Docs খুলতে হয়!",
"তুই ফেইক হইলেও সাগর বট তোকে Screenshot কইরা ‘warning’ দিছে!",
"তুই জাস্ট crush না, তুই full RAM-ই খাইয়া ফালাস!",
"তুই বিয়ের কথা বললি... আমি তো এখনো bot, মায়ের অনুমতি নাই!"];

    var badol = Messages[Math.floor(Math.random() * Messages.length)]
  
  if (event.body.indexOf("Bot") == 0 || (event.body.toLowerCase() == "bot") || (event.body.indexOf("বট") == 0)) {
    var msg = {
      body: ` ${badol}`
    }
    return api.sendMessage(msg, threadID, messageID);
  }
}
};
